Documents/НарядНаСмену.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НарядНаСмену</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланГорныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланГорныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланГорныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Понедельник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вторник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Среда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Четверг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пятница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суббота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Воскресенье</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРабот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыпускаемаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемоеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НарядНаСмену/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПланПриИзменении(Элемент)
    // Очищаем табличную часть перед заполнением
    Объект.Работы.Очистить();
    
    План = Объект.План;
    Если Не ЗначениеЗаполнено(План) Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем данные плана с сервера
    ДанныеПлана = ПолучитьДанныеПлана(План);
    Если ДанныеПлана = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Заполняем табличную часть данными из плана
    Для Каждого СтрокаПлана Из ДанныеПлана Цикл
        НоваяСтрока = Объект.Работы.Добавить();
        НоваяСтрока.ВидРабот = СтрокаПлана.ВидРабот;
        НоваяСтрока.Номенклатура = СтрокаПлана.Номенклатура;
        НоваяСтрока.ЕдиницаИзмерения = СтрокаПлана.ЕдиницаИзмерения;
        // Можно добавить планируемое количество, например, сумму по всем дням
        НоваяСтрока.ПланируемоеКоличество = СтрокаПлана.СуммаПлана;
        
        // Заполняем оборудование из вида работ (через сервер)
        Если ЗначениеЗаполнено(НоваяСтрока.ВидРабот) Тогда
            Оборудование = ПолучитьОборудованиеИзВидаРабот(НоваяСтрока.ВидРабот);
            Если Оборудование <> Неопределено Тогда
                НоваяСтрока.Оборудование = Оборудование;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеПлана(СсылкаПлан)
    
    Если Не ЗначениеЗаполнено(СсылкаПлан) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем данные плана
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ПланГорныхРаботРаботы.ВидРабот,
    |    ПланГорныхРаботРаботы.Номенклатура,
    |    ПланГорныхРаботРаботы.ЕдиницаИзмерения,
    |    ПланГорныхРаботРаботы.Понедельник + 
    |    ПланГорныхРаботРаботы.Вторник +
    |    ПланГорныхРаботРаботы.Среда +
    |    ПланГорныхРаботРаботы.Четверг +
    |    ПланГорныхРаботРаботы.Пятница +
    |    ПланГорныхРаботРаботы.Суббота +
    |    ПланГорныхРаботРаботы.Воскресенье КАК СуммаПлана
    |ИЗ
    |    Документ.ПланГорныхРабот.Работы КАК ПланГорныхРаботРаботы
    |ГДЕ
    |    ПланГорныхРаботРаботы.Ссылка = &СсылкаПлана";
    
    Запрос.УстановитьПараметр("СсылкаПлана", СсылкаПлан);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    МассивДанных = Новый Массив;
    
    Пока Выборка.Следующий() Цикл
        // Создаем структуру для каждой строки
        СтрокаДанных = Новый Структура;
        СтрокаДанных.Вставить("ВидРабот", Выборка.ВидРабот);
        СтрокаДанных.Вставить("Номенклатура", Выборка.Номенклатура);
        СтрокаДанных.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
        СтрокаДанных.Вставить("СуммаПлана", Выборка.СуммаПлана);
        
        МассивДанных.Добавить(СтрокаДанных);
    КонецЦикла;
    
    Возврат МассивДанных;
    
КонецФункции

&НаСервере
Функция ПолучитьОборудованиеИзВидаРабот(СсылкаВидаРабот)
    
    Если Не ЗначениеЗаполнено(СсылкаВидаРабот) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем оборудование из вида работ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    ВидыРаботИспользуемоеОборудование.Оборудование
    |ИЗ
    |    Справочник.ВидыРабот.ИспользуемоеОборудование КАК ВидыРаботИспользуемоеОборудование
    |ГДЕ
    |    ВидыРаботИспользуемоеОборудование.Ссылка = &СсылкаВидаРабот";
    
    Запрос.УстановитьПараметр("СсылкаВидаРабот", СсылкаВидаРабот);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Оборудование;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
